smirnovartem8/Milandr/MDR32F2C10/Keil.MDR32F2C10.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>MDR1986VK01</name>
  <description>Milandr MDR1986VK01 Series Device Support, Drivers and Examples</description>

  <releases>
    <release version="1.0.1">
      10/10/2020, V1.0.0 Initial version
	  11/11/2020, V1.0.1 SVD file added
    </release>
  </releases>
<!-- ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ -->   
  <devices>
    <family Dfamily="Milandr" Dvendor="Milandr:99">    
      <subFamily DsubFamily="Cortex-M4F">         
        <!-- MDR1986VK01 -->
        <device Dname="MDR1986VK01">
          <processor  Dcore="Cortex-M4" DcoreVersion="r0p0" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="160000000"/>
          <compile    header="Libraries\CMSIS\CM4\DeviceSupport\MDR1986VK01\inc\" define="USE_MDR1986VK01"/>
          <debug      svd="IDE\Keil\SVD\MDR1986VK01.svd"/>
          <memory     id="IROM1"                          start="0x2000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                          start="0x20000000"  size="0x20000"    init   ="1"   default="1"/>
          <!-- <algorithm  name="Flash\"           start="0x08000000"  size="0x20000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/> -->
          <description>
            (MDR1986VK01 RUS)
             Core:
             - two 32-bit ARM Cortex-M4F cores, running at frequencies of up to 160 MHz
             - 32-bit ARM Cortex-M0 Cryptographic core
             - memory Protection Unit (MPU)
             - 24-bit SysTick Timer

            Memory:
             - 1 MByte of EEPROM program memory w\ECC(SEC-DEC)
             - Built-in program memory type RAM 128 KB
             - Built-in data memory type RAM 128 KB
             - external system bus controller w\ECC(SEC-DEC)

            Supply and Clock rate:
             - internal regulator for core voltage supply
             - built-in power control system
             - internal battery domain
             - internal 8 MHz RC clock generator with calibration
             - internal 40 kHz RC clockgenerator with calibration
             - 2x external oscillator 1 .. 30 MHz
             - 4x on-board PLL for clock frequency 

            Low power consumption modes:
             - Sleep, Stop and Standby
             - battery domain with RTC and backup registers 

            Analog features:
             - 6x 12-bit ADC (8 channels)
             - 4x 12-bit DAC
             - 4x CMP

            Peripheral features:
             - EthernetMAC 10/100
             - USB 2.0 full-speed OTG controller
             - SpaceWire
             - MILSTD
             - 2xCAN, 2xSSP, 4xUART, 2xDMA, 4xTimer, 2xI2C
             - RTC
             - WDG
             - 96x GPIO

            Debug mode:
             - 2x JTAG and SWD
          </description>
        </device>
      </subFamily>
    </family>
  </devices>
<!-- ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ -->  
<examples>

      <example name="adc_potentiometer" doc="readme.txt" folder="Examples/adc_potentiometer">
    <description>Work with ADC using potentiometer</description>
    <board name="EVAL-BOARDMDR1986VK01" vendor="Milandr"/>
    <project>
      <environment name="uv" load="adc_potentiometer.uvprojx"/>
    </project>
    <attributes>
      <component Cclass="CMSIS"     Cgroup="CORE"/>
      <component Cclass="Device"    Cgroup="Startup"/>
    </attributes>
  </example>

        <example name="can_transceive" doc="readme.txt" folder="Examples/can_transceive">
    <description>Work with CAN</description>
    <board name="EVAL-BOARDMDR1986VK01" vendor="Milandr"/>
    <project>
      <environment name="uv" load="can_transceive.uvprojx"/>
    </project>
    <attributes>
      <component Cclass="CMSIS"     Cgroup="CORE"/>
      <component Cclass="Device"    Cgroup="Startup"/>
    </attributes>
  </example>

        <example name="canfd_transceive" doc="readme.txt" folder="Examples/canfd_transceive">
    <description>Work with CAN FD</description>
    <board name="EVAL-BOARDMDR1986VK01" vendor="Milandr"/>
    <project>
      <environment name="uv" load="canfd_transceive.uvprojx"/>
    </project>
    <attributes>
      <component Cclass="CMSIS"     Cgroup="CORE"/>
      <component Cclass="Device"    Cgroup="Startup"/>
    </attributes>
  </example>  

        <example name="dac_sine" doc="readme.txt" folder="Examples/dac_sine">
    <description>Work with DAC</description>
    <board name="EVAL-BOARDMDR1986VK01" vendor="Milandr"/>
    <project>
      <environment name="uv" load="dac_sine.uvprojx"/>
    </project>
    <attributes>
      <component Cclass="CMSIS"     Cgroup="CORE"/>
      <component Cclass="Device"    Cgroup="Startup"/>
    </attributes>
  </example>

          <example name="encoder" doc="readme.txt" folder="Examples/encoder">
    <description>Work with encoder</description>
    <board name="EVAL-BOARDMDR1986VK01" vendor="Milandr"/>
    <project>
      <environment name="uv" load="encoder.uvprojx"/>
    </project>
    <attributes>
      <component Cclass="CMSIS"     Cgroup="CORE"/>
      <component Cclass="Device"    Cgroup="Startup"/>
    </attributes>
  </example>

    <example name="eth_icmp" doc="readme.txt" folder="Examples/eth_icmp">
    <description>Work with ethernet</description>
    <board name="EVAL-BOARDMDR1986VK01" vendor="Milandr"/>
    <project>
      <environment name="uv" load="eth_icmp.uvprojx"/>
    </project>
    <attributes>
      <component Cclass="CMSIS"     Cgroup="CORE"/>
      <component Cclass="Device"    Cgroup="Startup"/>
    </attributes>
  </example>

      <example name="i2c_eeprom" doc="readme.txt" folder="Examples/i2c_eeprom">
    <description>Work with on board eeprom</description>
    <board name="EVAL-BOARDMDR1986VK01" vendor="Milandr"/>
    <project>
      <environment name="uv" load="i2c_eeprom.uvprojx"/>
    </project>
    <attributes>
      <component Cclass="CMSIS"     Cgroup="CORE"/>
      <component Cclass="Device"    Cgroup="Startup"/>
    </attributes>
  </example>

        <example name="milstd_transceive" doc="readme.txt" folder="Examples/milstd_transceive">
    <description>Work with milstd</description>
    <board name="EVAL-BOARDMDR1986VK01" vendor="Milandr"/>
    <project>
      <environment name="uv" load="milstd_transceive.uvprojx"/>
    </project>
    <attributes>
      <component Cclass="CMSIS"     Cgroup="CORE"/>
      <component Cclass="Device"    Cgroup="Startup"/>
    </attributes>
  </example>

  <example name="pwm_rgb" doc="readme.txt" folder="Examples/pwm_rgb">
    <description>Work with PWM channels connected with RGB lamp</description>
    <board name="EVAL-BOARDMDR1986VK01" vendor="Milandr"/>
    <project>
      <environment name="uv" load="pwm_rgb.uvprojx"/>
    </project>
    <attributes>
      <component Cclass="CMSIS"     Cgroup="CORE"/>
      <component Cclass="Device"    Cgroup="Startup"/>
    </attributes>
  </example>

      <example name="pwm_sync_adc" doc="readme.txt" folder="Examples/pwm_sync_adc">
    <description>Work with pwm kicking adc conversation</description>
    <board name="EVAL-BOARDMDR1986VK01" vendor="Milandr"/>
    <project>
      <environment name="uv" load="pwm_sync_adc.uvprojx"/>
    </project>
    <attributes>
      <component Cclass="CMSIS"     Cgroup="CORE"/>
      <component Cclass="Device"    Cgroup="Startup"/>
    </attributes>
  </example>

      <example name="rs485_ping_pong" doc="readme.txt" folder="Examples/rs485_ping_pong">
    <description>Work with rs485</description>
    <board name="EVAL-BOARDMDR1986VK01" vendor="Milandr"/>
    <project>
      <environment name="uv" load="rs485_ping_pong.uvprojx"/>
    </project>
    <attributes>
      <component Cclass="CMSIS"     Cgroup="CORE"/>
      <component Cclass="Device"    Cgroup="Startup"/>
    </attributes>
  </example>    

        <example name="rtc" doc="readme.txt" folder="Examples/rtc">
    <description>Work with rtc</description>
    <board name="EVAL-BOARDMDR1986VK01" vendor="Milandr"/>
    <project>
      <environment name="uv" load="rtc.uvprojx"/>
    </project>
    <attributes>
      <component Cclass="CMSIS"     Cgroup="CORE"/>
      <component Cclass="Device"    Cgroup="Startup"/>
    </attributes>
  </example>    

