smirnovartem8/Milandr/MDR32F2C10/Keil.MDR32F2C10.pdsc
        <example name="spi_flash1636" doc="readme.txt" folder="Examples/spi_flash1636">
    <description>Work with 1636 flash</description>
    <board name="EVAL-BOARDMDR1986VK01" vendor="Milandr"/>
    <project>
      <environment name="uv" load="spi_flash1636.uvprojx"/>
    </project>
    <attributes>
      <component Cclass="CMSIS"     Cgroup="CORE"/>
      <component Cclass="Device"    Cgroup="Startup"/>
    </attributes>
  </example>    

        <example name="uart_echo" doc="readme.txt" folder="Examples/uart_echo">
    <description>Work with uart</description>
    <board name="EVAL-BOARDMDR1986VK01" vendor="Milandr"/>
    <project>
      <environment name="uv" load="uart_echo.uvprojx"/>
    </project>
    <attributes>
      <component Cclass="CMSIS"     Cgroup="CORE"/>
      <component Cclass="Device"    Cgroup="Startup"/>
    </attributes>
  </example>    

        <example name="sdio" doc="readme.txt" folder="Examples/sdio">
    <description>Work with SDIO</description>
    <board name="EVAL-BOARDMDR1986VK01" vendor="Milandr"/>
    <project>
      <environment name="uv" load="sdio.uvprojx"/>
    </project>
    <attributes>
      <component Cclass="CMSIS"     Cgroup="CORE"/>
      <component Cclass="Device"    Cgroup="Startup"/>
    </attributes>
  </example>      

        <example name="dma_pingpong" doc="readme.txt" folder="Examples/dma_pingpong">
    <description>Work with DMA</description>
    <board name="EVAL-BOARDMDR1986VK01" vendor="Milandr"/>
    <project>
      <environment name="uv" load="dma_pingpong.uvprojx"/>
    </project>
    <attributes>
      <component Cclass="CMSIS"     Cgroup="CORE"/>
      <component Cclass="Device"    Cgroup="Startup"/>
    </attributes>
  </example>        

        <example name="usb_cdc_echo" doc="readme.txt" folder="Examples/usb_cdc_echo">
    <description>Work with USB</description>
    <board name="EVAL-BOARDMDR1986VK01" vendor="Milandr"/>
    <project>
      <environment name="uv" load="usb_cdc_echo.uvprojx"/>
    </project>
    <attributes>
      <component Cclass="CMSIS"     Cgroup="CORE"/>
      <component Cclass="Device"    Cgroup="Startup"/>
    </attributes>
  </example>          

</examples>
<!-- ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ -->
<boards>
  <board vendor="Milandr" name="EVAL-BOARDMDR1986VK01" revision="V1" salesContact="sales@keil.com" orderForm="http://www.keil.com">
    <description>Milandr EVAL-BOARDMDR1986VK01 Board Description</description>
    <book category="setup"     name="Docs/MyDevBoard/MyDevBoard_setup.pdf"      title="Getting Started"/>
    <book category="schematic" name="Docs/MyDevBoard/MyDevBoard_schematics.pdf" title="Schematics"/>
    <book category="manual"    name="Docs/MyDevBoard/MyDevBoard_um.pdf"         title="User Manual"/>
    <mountedDevice             deviceIndex="0" Dvendor="Milandr:99" Dname="MDR32F2C10"/>
    <compatibleDevice          deviceIndex="0" Dvendor="Milandr:99" Dfamily="Milandr"/>
    <feature type="ODbg"       n="1"           name="On-board J-LINK Lite"/>
    <feature type="PWR"        n="5"           name="USB Powered"/>
    <feature type="DIO"        n="8"/>
    <feature type="SPI"        n="1"/>
    <feature type="LED"        n="6"           name="User LEDs"/>
    <feature type="ArduinoFF"  n="1"/>
    <debugInterface adapter="J-Link Lite"      connector="Mini-USB"/>
  </board>
</boards>
<!-- ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ -->
<conditions>
<condition id="MCU Series">
  <description>ARM Cortex M4 device required</description>
  <require Dfamily="Milandr" Dvendor="Milandr:99"/>
</condition>
<condition id="EVAL-BOARDMDR1986VK01 Setup">
  <description>Board Setup Code required</description>
  <require condition="MCU Series"/>
  <require Cclass="Board Support" Cgroup="Board Setup"/>
</condition>
  <condition id="CON_MDR1986VK01">
    <description>MDR1986VK01 device</description>
    <accept Dname="MDR1986VK01"/>
    <require Cclass="Board Support" Cgroup="Board Setup"/>
  </condition>
</conditions>
<!-- ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ -->
  <!-- component section (optional for all Software Packs)-->
  <components>
  <bundle Cbundle="EVAL-BOARDMDR1986VK01 Support" Cclass="Board Support" Cversion="1.0">
  <description>EVAL-BOARDMDR1986VK01 custom board support package</description>
  <doc>Docs/BSP/MyBSP.htm</doc>
  <component Cgroup="Board Setup" condition="MCU Series">
    <description>Custom board setup code</description>
<!--     <files>
      <file category="header" name="Libraries\spec.h"/>
      <file category="header" name="Libraries\mdr32f8_it.h"/>
      <file category="source" name="Libraries\spec.c"/>
    </files> -->
  </component>
</bundle>	
<!-- ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>System Startup for MDR1986VK01 device series</description>
      <files>
      <file category="source" name="Libraries\CMSIS\CM4\DeviceSupport\MDR1986VK01\startup\arm\startup_MDR32F2C10.s" attr="config"/>
	      <file category="source" name="Libraries\CMSIS\CM4\DeviceSupport\MDR1986VK01\startup\arm\system_MDR32F2C10.c" attr="config"/>
	      <file category="header" name="Libraries\CMSIS\CM4\DeviceSupport\MDR1986VK01\startup\arm\system_MDR32F2C10.h" attr="config"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="ADC" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>ADC for MDR1986VK01 device series</description>
      <files>
        <file category="source" name="BSP\Device\src\adc.c" attr="config"/>
        <file category="header" name="BSP\Device\inc\adc.h" attr="config"/>
      </files>
    </component>        

    <component Cclass="Device" Cgroup="ADCSYNC" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>ADCSYNC for MDR1986VK01 device series</description>
      <files>
        <file category="source" name="BSP\Device\src\adcsync.c" attr="config"/>
        <file category="header" name="BSP\Device\inc\adcsync.h" attr="config"/>
      </files>
    </component>            

    <component Cclass="Device" Cgroup="CAN" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>CAN for MDR1986VK01 device series</description>
      <files>
        <file category="source" name="BSP\Device\src\can.c" attr="config"/>
        <file category="header" name="BSP\Device\inc\can.h" attr="config"/>
      </files>
    </component>            

    <component Cclass="Device" Cgroup="DAC" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>DAC for MDR1986VK01 device series</description>
      <files>
        <file category="source" name="BSP\Device\src\dac.c" attr="config"/>
        <file category="header" name="BSP\Device\inc\dac.h" attr="config"/>
      </files>
    </component>            

    <component Cclass="Device" Cgroup="ENC" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>ENC for MDR1986VK01 device series</description>
      <files>
        <file category="source" name="BSP\Device\src\encoder.c" attr="config"/>
        <file category="header" name="BSP\Device\inc\encoder.h" attr="config"/>
      </files>
    </component>            

    <component Cclass="Device" Cgroup="ETH" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>ETH for MDR1986VK01 device series</description>
      <files>
        <file category="source" name="BSP\Device\src\eth.c" attr="config"/>
        <file category="header" name="BSP\Device\inc\eth.h" attr="config"/>
      </files>
    </component>            

