smirnovartem8/Milandr/MDR32F2C10/Keil.MDR32F2C10.pdsc
    <component Cclass="Device" Cgroup="I2C" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>I2C for MDR1986VK01 device series</description>
      <files>
        <file category="source" name="BSP\Device\src\i2c.c" attr="config"/>
        <file category="header" name="BSP\Device\inc\i2c.h" attr="config"/>
      </files>
    </component>                

    <component Cclass="Device" Cgroup="I2C_EEPROM" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>I2C_EEPROM for MDR1986VK01 device series</description>
      <files>
        <file category="source" name="BSP\Device\src\i2c_eeprom.c" attr="config"/>
        <file category="header" name="BSP\Device\inc\i2c_eeprom.h" attr="config"/>
      </files>
    </component>                

    <component Cclass="Device" Cgroup="Leds" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>Leds for MDR1986VK01 device series</description>
      <files>
        <file category="source" name="BSP\Device\src\leds.c" attr="config"/>
        <file category="header" name="BSP\Device\inc\leds.h" attr="config"/>
      </files>
    </component>    

    <component Cclass="Device" Cgroup="MILSTD" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>MILSTD for MDR1986VK01 device series</description>
      <files>
        <file category="source" name="BSP\Device\src\milstd.c" attr="config"/>
        <file category="header" name="BSP\Device\inc\milstd.h" attr="config"/>
      </files>
    </component>    

    <component Cclass="Device" Cgroup="PWM" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>PWM for MDR1986VK01 device series</description>
      <files>
        <file category="source" name="BSP\Device\src\pwm.c" attr="config"/>
        <file category="header" name="BSP\Device\inc\pwm.h" attr="config"/>
      </files>
    </component>    

    <component Cclass="Device" Cgroup="RS485" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>RS485 for MDR1986VK01 device series</description>
      <files>
        <file category="source" name="BSP\Device\src\rs485.c" attr="config"/>
        <file category="header" name="BSP\Device\inc\rs485.h" attr="config"/>
      </files>
    </component>    

    <component Cclass="Device" Cgroup="RTC" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>RTC for MDR1986VK01 device series</description>
      <files>
        <file category="source" name="BSP\Device\src\rtc.c" attr="config"/>
        <file category="header" name="BSP\Device\inc\rtc.h" attr="config"/>
      </files>
    </component>    

    <component Cclass="Device" Cgroup="SPI" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>SPI for MDR1986VK01 device series</description>
      <files>
        <file category="source" name="BSP\Device\src\spi.c" attr="config"/>
        <file category="header" name="BSP\Device\inc\spi.h" attr="config"/>
      </files>
    </component>    

    <component Cclass="Device" Cgroup="CONFIG" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>CONFIG for MDR1986VK01 device series</description>
      <files>
        <file category="header" name="BSP\Device\inc\MDR32F2C10_config.h" attr="config"/>
      </files>
    </component>    

    <component Cclass="Device" Cgroup="DEMOBOARD" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>DEMOBOARD for MDR1986VK01 device series</description>
      <files>
        <file category="header" name="BSP\Device\inc\demoboard.h" attr="config"/>
      </files>
    </component>        

    <component Cclass="Device" Cgroup="SDIO" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>SDIO for MDR1986VK01 device series</description>
      <files>
        <file category="header" name="BSP\Device\inc\sdio.h" attr="config"/>
      </files>
    </component>        

    <component Cclass="Drivers" Cgroup="PORT" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>PORT driver for MDR1986VK01 Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F2C10_StdPeriph_Driver\inc\MDR32F2C10_port.h"/>
        <file category="source" name="Libraries\MDR32F2C10_StdPeriph_Driver\src\MDR32F2C10_port.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="CLK" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>CLK driver for MDR1986VK01 Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F2C10_StdPeriph_Driver\inc\MDR32F2C10_clk.h"/>
        <file category="source" name="Libraries\MDR32F2C10_StdPeriph_Driver\src\MDR32F2C10_clk.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="UART" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>UART driver for MDR1986VK01 Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F2C10_StdPeriph_Driver\inc\MDR32F2C10_uart.h"/>
        <file category="source" name="Libraries\MDR32F2C10_StdPeriph_Driver\src\MDR32F2C10_uart.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="SSP" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>SSP driver for MDR1986VK01 Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F2C10_StdPeriph_Driver\inc\MDR32F2C10_ssp.h"/>
        <file category="source" name="Libraries\MDR32F2C10_StdPeriph_Driver\src\MDR32F2C10_ssp.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="SDIO" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>SDIO driver for MDR1986VK01 Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F2C10_StdPeriph_Driver\inc\MDR32F2C10_sdio.h"/>
        <file category="source" name="Libraries\MDR32F2C10_StdPeriph_Driver\src\MDR32F2C10_sdio.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="CAN" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>CAN driver for MDR1986VK01 Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F2C10_StdPeriph_Driver\inc\MDR32F2C10_can.h"/>
        <file category="source" name="Libraries\MDR32F2C10_StdPeriph_Driver\src\MDR32F2C10_can.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="CAN_FD" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>CAN FD driver for MDR1986VK01 Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F2C10_StdPeriph_Driver\inc\MDR32F2C10_canfd.h"/>
        <file category="source" name="Libraries\MDR32F2C10_StdPeriph_Driver\src\MDR32F2C10_canfd.c"/>
      </files>
    </component>    

    <component Cclass="Drivers" Cgroup="TIM" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>TIM driver for MDR1986VK01 Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F2C10_StdPeriph_Driver\inc\MDR32F2C10_timer.h"/>
        <file category="source" name="Libraries\MDR32F2C10_StdPeriph_Driver\src\MDR32F2C10_timer.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="DMA" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>DMA driver for MDR1986VK01 Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F2C10_StdPeriph_Driver\inc\MDR32F2C10_dma.h"/>
        <file category="source" name="Libraries\MDR32F2C10_StdPeriph_Driver\src\MDR32F2C10_dma.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="MIL_STD_1553" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>MIL_STD_1553 driver for MDR1986VK01 Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F2C10_StdPeriph_Driver\inc\MDR32F2C10_milstd.h"/>
        <file category="source" name="Libraries\MDR32F2C10_StdPeriph_Driver\src\MDR32F2C10_milstd.c"/>
      </files>
    </component>   

    <component Cclass="Drivers" Cgroup="ETH" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>ETHERNET driver for MDR1986VK01 Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F2C10_StdPeriph_Driver\inc\MDR32F2C10_eth.h"/>
        <file category="source" name="Libraries\MDR32F2C10_StdPeriph_Driver\src\MDR32F2C10_eth.c"/>
      </files>
    </component>   

