smirnovartem8/Milandr/MDR32F2C10/Keil.MDR32F2C10.pdsc
    <component Cclass="Drivers" Cgroup="EBC" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>EBC driver for MDR1986VK01 Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F2C10_StdPeriph_Driver\inc\MDR32F2C10_ebc.h"/>
        <file category="source" name="Libraries\MDR32F2C10_StdPeriph_Driver\src\MDR32F2C10_ebc.c"/>
      </files>
    </component>         

    <component Cclass="Drivers" Cgroup="I2C" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>I2C driver for MDR1986VK01 Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F2C10_StdPeriph_Driver\inc\MDR32F2C10_i2c.h"/>
        <file category="source" name="Libraries\MDR32F2C10_StdPeriph_Driver\src\MDR32F2C10_i2c.c"/>
      </files>
    </component>             

    <component Cclass="Drivers" Cgroup="DELAY" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>I2C driver for MDR1986VK01 Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F2C10_StdPeriph_Driver\inc\MDR32F2C10_delay.h"/>
        <file category="source" name="Libraries\MDR32F2C10_StdPeriph_Driver\src\MDR32F2C10_delay.c"/>
      </files>
    </component>                 

    <component Cclass="Drivers" Cgroup="USB" Cversion="1.0" condition="CON_MDR1986VK01">
      <description>USB driver for MDR1986VK01 Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F2C10_StdPeriph_Driver\inc\MDR32F2C10_usb.h"/>
        <file category="source" name="Libraries\MDR32F2C10_StdPeriph_Driver\src\MDR32F2C10_usb.c"/>
      </files>
    </component>                     

  </components>
<!-- ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ -->

</package>